# Groups Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DefinitionFile..::..Groups Property
DefinitionFile Class See Also
---
Return a map of shared parameter definition groups contained within the file.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DefinitionGroups Groups { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Groups As DefinitionGroups
	Get
```

Visual C++
---
```text
public:
property DefinitionGroups^ Groups {
	DefinitionGroups^ get ();
}
```

# Remarks
A particular group can be found by Name, using the Item property on the DefinitionGroups object. A new group can be created by using the Create method on the DefinitionGroups Object. The Create method takes the name of the new group, as a string, as its input parameter, returning a reference to a new definition group object as its result.
# See Also
DefinitionFile Class
Autodesk.Revit.DB Namespace